---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ValueAtPoint Constructor
ValueAtPoint Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ValueAtPoint(IList<(Of <<'(Double>)>>)) | Creates object from an array of values |
|  | ValueAtPoint(ValueAtPoint) | Creates a copy of the given ValueAtPoint instance. |

# See Also

ValueAtPoint Class

ValueAtPoint Members

Autodesk.Revit.DB.Analysis Namespace